; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	image3 - mode
	spectrograph0 - mode
	thermograph2 - mode
	infrared1 - mode
	Star4 - direction
	Star1 - direction
	Star3 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Planet5 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 image3)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument1 spectrograph0)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet12)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star1)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon8)
	(supports instrument5 infrared1)
	(supports instrument5 image3)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star3)
	(supports instrument6 image3)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 Star3)
	(supports instrument7 thermograph2)
	(supports instrument7 infrared1)
	(supports instrument7 image3)
	(calibration_target instrument7 GroundStation2)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star13)
	(supports instrument8 spectrograph0)
	(supports instrument8 image3)
	(supports instrument8 thermograph2)
	(calibration_target instrument8 GroundStation0)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation0)
)
(:goal (and
	(pointing satellite0 Planet7)
	(pointing satellite2 Planet5)
	(pointing satellite4 Planet12)
	(have_image Planet5 image3)
	(have_image Planet6 image3)
	(have_image Planet7 spectrograph0)
	(have_image Phenomenon8 infrared1)
	(have_image Star9 spectrograph0)
	(have_image Star10 spectrograph0)
	(have_image Phenomenon11 infrared1)
	(have_image Planet12 image3)
	(have_image Star13 thermograph2)
))

)

; plan
1. (switch_on instrument8 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument8)
   goals met: 0 of 12
2. (calibrate satellite4 instrument8 groundstation0)
   added: (calibrated instrument8)
   goals met: 0 of 12
3. (turn_to satellite4 planet7 groundstation0)
   deleted: (pointing satellite4 groundstation0)
   added: (pointing satellite4 planet7)
   goals met: 0 of 12
4. (take_image satellite4 planet7 instrument8 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 1 of 12
5. (turn_to satellite4 planet6 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 planet6)
   goals met: 1 of 12
6. (take_image satellite4 planet6 instrument8 image3)
   added: (have_image planet6 image3)
   goals met: 2 of 12
7. (turn_to satellite4 planet5 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 planet5)
   goals met: 2 of 12
8. (take_image satellite4 planet5 instrument8 image3)
   added: (have_image planet5 image3)
   goals met: 3 of 12
9. (turn_to satellite4 planet12 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 planet12)
   goals met: 4 of 12
10. (turn_to satellite1 groundstation0 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 groundstation0)
   goals met: 4 of 12
11. (turn_to satellite0 planet7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet7)
   goals met: 5 of 12
12. (take_image satellite4 planet12 instrument8 image3)
   added: (have_image planet12 image3)
   goals met: 6 of 12
13. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 6 of 12
14. (calibrate satellite1 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 6 of 12
15. (turn_to satellite1 phenomenon11 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon11)
   goals met: 6 of 12
16. (take_image satellite1 phenomenon11 instrument1 infrared1)
   added: (have_image phenomenon11 infrared1)
   goals met: 7 of 12
17. (turn_to satellite1 phenomenon8 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon8)
   goals met: 7 of 12
18. (take_image satellite1 phenomenon8 instrument1 infrared1)
   added: (have_image phenomenon8 infrared1)
   goals met: 8 of 12
19. (turn_to satellite1 star10 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star10)
   goals met: 8 of 12
20. (take_image satellite1 star10 instrument1 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 9 of 12
21. (turn_to satellite1 star13 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star13)
   goals met: 9 of 12
22. (take_image satellite1 star13 instrument1 thermograph2)
   added: (have_image star13 thermograph2)
   goals met: 10 of 12
23. (turn_to satellite1 star9 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star9)
   goals met: 10 of 12
24. (take_image satellite1 star9 instrument1 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 11 of 12
25. (turn_to satellite2 planet5 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 planet5)
   goals met: 12 of 12
